# Task_1
# По данному целому неотрицательному n вычислите значение n! = 1*2*3*...*N
# (произведение всех чисел от 1 до N) 0! = 1
# Решить задачу используя цикл while
"""
n = int(input("Введите число: "))
i = 2
result = 1
while i <= n:
    result *= i
    i += 1
print(f"{n}! = {result}")
"""

#Task_2
# Дано натуральное число A>1.
# Определите, каким по счету числом Фибоначчи оно является, т.е. введите такое число
# n, что Ф(n) = A.
# Если А не является числом Фибоначчи, введите число -1.

